#!/usr/bin/python3

#Задание номер 1
list1 = [1,2,3,4,5,6]
summa = 0
average = 0

for item in list1:
    summa += item
    
average = summa / len(list1)
print("Cумма: ", summa)
print("Среднее значение: ", average)
print("________________________________")

#Задание номер 2
cort1 = ("Евген","Данила","Влад","Константин")
for chelovek in cort1:
    print(("ТОО 'Рога и копыта', имя сотрудника: "), chelovek)
print("________________________________")

#Задание номер 3
cort2 = ["Евген","Данила","Влад","Константин"]
evgen=input("Введите имя сотрудника: ")
if evgen == "Евген":
    del cort2[0]
    print("Данный сотрудник был удалён из базы!")
else:
    print("Сотрудник не был удалён так как его нет в базе!")
print(cort2)
print('---------------------------------------------------------------------------------')

#За# Задание номер 4
cort3 = ['Евгений', 'Даниил', 'Владислав', 'Константин', 'Ден', 'Тема']
names_to_remove = []
for name in cort3:
    if len(name) < 5:
        names_to_remove.append(name)

for name in names_to_remove:
    cort3.remove(name)

print("Мы удалили погоняла и клички, теперь только нормальные полные именна!")
for chelovek1 in cort3:
    print(("ТОО 'Рога и копыта', имя сотрудника: "), chelovek1)
print('---------------------------------------------------------------------------------')
    
